chat-load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 30   # users/sec
  engines:
    socketio: {}

scenarios:
  - name: "chat users"
    engine: socketio
    flow:
      - emit:
          channel: "joinRoom"
          data:
            username: "loadUser{{ $randomNumber(1, 100000) }}"
            room: "roomLoad"

      - think: 1

      - emit:
          channel: "sendMessage"
          data:
            room: "roomLoad"
            username: "loadUser"
            message: "stress test"

      - think: 3

#npx artillery run chat-load-test.yml