chat-load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5        # users/sec 
      rampTo: 10            # gradual increase
  engines:
    socketio: {}

scenarios:
  - name: "chat users"
    engine: socketio
    flow:
      - emit:
          channel: "joinRoom"
          data:
            username: "loadUser{{ $randomNumber(1, 100000) }}"
            room: "roomLoad"

      - think: 3            # slower pacing 

      - emit:
          channel: "sendMessage"
          data:
            room: "roomLoad"
            username: "loadUser{{ $randomNumber(1, 100000) }}"
            message: "stress test"

      - think: 5            # longer delay 


# npx artillery run chat-load-test.yml